# Используем официальный образ Node.js в качестве базового образа
FROM node:16-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости
#RUN npm install
RUN npm ci 

# Копируем все файлы приложения внутрь контейнера
COPY . .

# Указываем порт, который будет использоваться приложением
ENV PORT=3000

EXPOSE $PORT

#EXPOSE 3000

# Запускаем приложение
CMD ["npm", "start"]
